{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": " ",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "|",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "'",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "": 0,
      " ": 1,
      "[UNK]": 2,
      "|": 3,
      "'": 4,
      "a": 5,
      "b": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "g": 11,
      "h": 12,
      "i": 13,
      "j": 14,
      "k": 15,
      "l": 16,
      "m": 17,
      "n": 18,
      "o": 19,
      "p": 20,
      "q": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "v": 26,
      "w": 27,
      "x": 28,
      "y": 29,
      "z": 30,
      "th": 31,
      "the": 32,
      "in": 33,
      "an": 34,
      "er": 35,
      "re": 36,
      "on": 37,
      "ou": 38,
      "en": 39,
      "ed": 40,
      "at": 41,
      "and": 42,
      "to": 43,
      "is": 44,
      "as": 45,
      "of": 46,
      "or": 47,
      "ing": 48,
      "ar": 49,
      "it": 50,
      "es": 51,
      "he": 52,
      "al": 53,
      "le": 54,
      "st": 55,
      "se": 56,
      "ad": 57,
      "wh": 58,
      "ch": 59
    },
    "merges": [
      "t h",
      "th e",
      "i n",
      "a n",
      "e r",
      "r e",
      "o n",
      "o u",
      "e n",
      "e d",
      "a t",
      "an d",
      "t o",
      "i s",
      "a s",
      "o f",
      "o r",
      "in g",
      "a r",
      "i t",
      "e s",
      "h e",
      "a l",
      "l e",
      "s t",
      "s e",
      "a d",
      "w h",
      "c h"
    ]
  }
}